avr-rust/avrd/packs/tiny/ATtiny104.atdf
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
          </instance>
        </module>
        <module name="USART">
          <instance name="USART" caption="USART">
            <register-group name="USART" name-in-module="USART" offset="0" address-space="data" caption="USART"/>
            <signals>
              <signal function="USART" group="XCK" pad="PB1"/>
              <signal function="USART" group="TXD" pad="PB2"/>
              <signal function="USART" group="RXD" pad="PB3"/>
            </signals>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
        <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
        <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="3" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
        <interrupt index="4" name="TIM0_CAPT" caption="Timer/Counter0 Input Capture"/>
        <interrupt index="5" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="6" name="TIM0_COMPA" caption="Timer/Counter Compare Match A"/>
        <interrupt index="7" name="TIM0_COMPB" caption="Timer/Counter Compare Match B"/>
        <interrupt index="8" name="ANA_COMP" caption="Analog Comparator"/>
        <interrupt index="9" name="WDT" caption="Watchdog Time-out"/>
        <interrupt index="10" name="VLM" caption="Vcc Voltage Level Monitor"/>
        <interrupt index="11" name="ADC" caption="ADC Conversion complete"/>
        <interrupt index="12" name="USART_RXS" caption="USART RX Start"/>
        <interrupt index="13" name="USART_RXC" caption="USART RX Complete"/>
        <interrupt index="14" name="USART_DRE" caption="USART Data register empty"/>
        <interrupt index="15" name="USART_TXC" caption="USART Tx Complete"/>
      </interrupts>
      <interfaces>
        <interface name="TPI" type="tpi"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x90"/>
          <property name="SIGNATURE2" value="0x0b"/>
        </property-group>
        <!-- Experimental: Expose CCP signature values -->
        <property-group name="CCP_SIGNATURES">      
          <property name="CCP_IOREG_gc" value="0xD8" caption="IOREG signature for Change Protect"/>
          <property name="CCP_SPM_gc" value="0xE7" caption="SPM signature for Change Protect"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="BYTE0" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Self programming enable" mask="0x08" name="SELFPROGEN"/>
          <bitfield caption="Output external clock" mask="0x04" name="CKOUT"/>
          <bitfield caption="Watch dog timer always on" mask="0x02" name="WDTON"/>
          <bitfield caption="Disable external reset" mask="0x01" name="RSTDISBL"/>
        </register>
      </register-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x1B" size="1">
          <bitfield caption="Analog Channel Selection Bits" mask="0x07" name="MUX" values="ADC_MUX_TINY10X"/>
          <bitfield caption="Analog Reference voltage Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF_TINY10X"/>
        </register>
        <register caption="ADC Data Register Low" name="ADCL" offset="0x19" size="1" mask="0xFF"/>
        <register caption="ADC Data Register High" name="ADCH" offset="0x1A" size="1" mask="0xFF"/>
        <register caption="The ADC Control and Status register A" name="ADCSRA" offset="0x1D" size="1">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC  Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="The ADC Control and Status register B" name="ADCSRB" offset="0x1C" size="1">
          <bitfield caption="Left Adjustment for ADC Result Readout" mask="0x80" name="ADLAR"/>
          <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER_T10"/>
        </register>
        <register caption="Digital Input Disable Register" name="DIDR0" offset="0x17" size="1">
          <bitfield caption="ADC7 Digital Input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC6 Digital Input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital Input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital Input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital Input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital Input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital Input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital Input Disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_ADC_V_REF_TINY10X">
        <value caption="Vcc" name="VAL_0x00" value="0x00"/>
        <value caption="Internal 1.1V Referemce" name="VAL_0x01" value="0x01"/>
        <value caption="Internal 2.2V Referemce" name="VAL_0x02" value="0x02"/>
        <value caption="Internal 4.3V Referemce" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ADC_MUX_TINY10X">
        <value caption="ADC0" name="ADC0" value="0x00"/>
        <value caption="ADC1" name="ADC1" value="0x01"/>
        <value caption="ADC2" name="ADC2" value="0x02"/>
        <value caption="ADC3" name="ADC3" value="0x03"/>
        <value caption="ADC4" name="ADC4" value="0x04"/>
        <value caption="ADC5" name="ADC5" value="0x05"/>
        <value caption="ADC6" name="ADC6" value="0x06"/>
        <value caption="ADC7" name="ADC7" value="0x07"/>
      </value-group>
